FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/pio/pio_samv71n19.h
#define PIO_PD0B_PWMC1_PWML0         ( 1u << 0 )  /**< \brief Pwm1 signal: PWMC1_PWML0 */
#define PIO_PA13C_PWMC1_PWML1        ( 1u << 13 ) /**< \brief Pwm1 signal: PWMC1_PWML1 */
#define PIO_PD2B_PWMC1_PWML1         ( 1u << 2 )  /**< \brief Pwm1 signal: PWMC1_PWML1 */
#define PIO_PA23D_PWMC1_PWML2        ( 1u << 23 ) /**< \brief Pwm1 signal: PWMC1_PWML2 */
#define PIO_PD4B_PWMC1_PWML2         ( 1u << 4 )  /**< \brief Pwm1 signal: PWMC1_PWML2 */
#define PIO_PA5A_PWMC1_PWML3         ( 1u << 5 )  /**< \brief Pwm1 signal: PWMC1_PWML3 */
#define PIO_PD6B_PWMC1_PWML3         ( 1u << 6 )  /**< \brief Pwm1 signal: PWMC1_PWML3 */
/* ========== Pio definition for QSPI peripheral ========== */
#define PIO_PA11A_QCS                ( 1u << 11 ) /**< \brief Qspi signal: QCS */
#define PIO_PA13A_QIO0               ( 1u << 13 ) /**< \brief Qspi signal: QIO0 */
#define PIO_PA12A_QIO1               ( 1u << 12 ) /**< \brief Qspi signal: QIO1 */
#define PIO_PA17A_QIO2               ( 1u << 17 ) /**< \brief Qspi signal: QIO2 */
#define PIO_PD31A_QIO3               ( 1u << 31 ) /**< \brief Qspi signal: QIO3 */
#define PIO_PA14A_QSCK               ( 1u << 14 ) /**< \brief Qspi signal: QSCK */
/* ========== Pio definition for SPI0 peripheral ========== */
#define PIO_PD20B_SPI0_MISO          ( 1u << 20 ) /**< \brief Spi0 signal: SPI0_MISO */
#define PIO_PD21B_SPI0_MOSI          ( 1u << 21 ) /**< \brief Spi0 signal: SPI0_MOSI */
#define PIO_PB2D_SPI0_NPCS0          ( 1u << 2 )  /**< \brief Spi0 signal: SPI0_NPCS0 */
#define PIO_PA31A_SPI0_NPCS1         ( 1u << 31 ) /**< \brief Spi0 signal: SPI0_NPCS1 */
#define PIO_PD25B_SPI0_NPCS1         ( 1u << 25 ) /**< \brief Spi0 signal: SPI0_NPCS1 */
#define PIO_PD12C_SPI0_NPCS2         ( 1u << 12 ) /**< \brief Spi0 signal: SPI0_NPCS2 */
#define PIO_PD27B_SPI0_NPCS3         ( 1u << 27 ) /**< \brief Spi0 signal: SPI0_NPCS3 */
#define PIO_PD22B_SPI0_SPCK          ( 1u << 22 ) /**< \brief Spi0 signal: SPI0_SPCK */
/* ========== Pio definition for SPI1 peripheral ========== */
#define PIO_PC26C_SPI1_MISO          ( 1u << 26 ) /**< \brief Spi1 signal: SPI1_MISO */
#define PIO_PC27C_SPI1_MOSI          ( 1u << 27 ) /**< \brief Spi1 signal: SPI1_MOSI */
#define PIO_PC25C_SPI1_NPCS0         ( 1u << 25 ) /**< \brief Spi1 signal: SPI1_NPCS0 */
#define PIO_PC28C_SPI1_NPCS1         ( 1u << 28 ) /**< \brief Spi1 signal: SPI1_NPCS1 */
#define PIO_PD0C_SPI1_NPCS1          ( 1u << 0 )  /**< \brief Spi1 signal: SPI1_NPCS1 */
#define PIO_PC29C_SPI1_NPCS2         ( 1u << 29 ) /**< \brief Spi1 signal: SPI1_NPCS2 */
#define PIO_PD1C_SPI1_NPCS2          ( 1u << 1 )  /**< \brief Spi1 signal: SPI1_NPCS2 */
#define PIO_PC30C_SPI1_NPCS3         ( 1u << 30 ) /**< \brief Spi1 signal: SPI1_NPCS3 */
#define PIO_PD2C_SPI1_NPCS3          ( 1u << 2 )  /**< \brief Spi1 signal: SPI1_NPCS3 */
#define PIO_PC24C_SPI1_SPCK          ( 1u << 24 ) /**< \brief Spi1 signal: SPI1_SPCK */
/* ========== Pio definition for SSC peripheral ========== */
#define PIO_PA10C_RD                 ( 1u << 10 ) /**< \brief Ssc signal: RD */
#define PIO_PD24B_RF                 ( 1u << 24 ) /**< \brief Ssc signal: RF */
#define PIO_PA22A_RK                 ( 1u << 22 ) /**< \brief Ssc signal: RK */
#define PIO_PB5D_TD                  ( 1u << 5 )  /**< \brief Ssc signal: TD */
#define PIO_PD10C_TD                 ( 1u << 10 ) /**< \brief Ssc signal: TD */
#define PIO_PD26B_TD                 ( 1u << 26 ) /**< \brief Ssc signal: TD */
#define PIO_PB0D_TF                  ( 1u << 0 )  /**< \brief Ssc signal: TF */
#define PIO_PB1D_TK                  ( 1u << 1 )  /**< \brief Ssc signal: TK */
/* ========== Pio definition for TC0 peripheral ========== */
#define PIO_PA4B_TCLK0               ( 1u << 4 )  /**< \brief Tc0 signal: TCLK0 */
#define PIO_PA28B_TCLK1              ( 1u << 28 ) /**< \brief Tc0 signal: TCLK1 */
#define PIO_PA29B_TCLK2              ( 1u << 29 ) /**< \brief Tc0 signal: TCLK2 */
#define PIO_PA0B_TIOA0               ( 1u << 0 )  /**< \brief Tc0 signal: TIOA0 */
#define PIO_PA15B_TIOA1              ( 1u << 15 ) /**< \brief Tc0 signal: TIOA1 */
#define PIO_PA26B_TIOA2              ( 1u << 26 ) /**< \brief Tc0 signal: TIOA2 */
#define PIO_PA1B_TIOB0               ( 1u << 1 )  /**< \brief Tc0 signal: TIOB0 */
#define PIO_PA16B_TIOB1              ( 1u << 16 ) /**< \brief Tc0 signal: TIOB1 */
#define PIO_PA27B_TIOB2              ( 1u << 27 ) /**< \brief Tc0 signal: TIOB2 */
/* ========== Pio definition for TC3 peripheral ========== */
#define PIO_PE5B_TCLK10              ( 1u << 5 )  /**< \brief Tc3 signal: TCLK10 */
#define PIO_PD24C_TCLK11             ( 1u << 24 ) /**< \brief Tc3 signal: TCLK11 */
#define PIO_PE2B_TCLK9               ( 1u << 2 )  /**< \brief Tc3 signal: TCLK9 */
#define PIO_PE3B_TIOA10              ( 1u << 3 )  /**< \brief Tc3 signal: TIOA10 */
#define PIO_PD21C_TIOA11             ( 1u << 21 ) /**< \brief Tc3 signal: TIOA11 */
#define PIO_PE0B_TIOA9               ( 1u << 0 )  /**< \brief Tc3 signal: TIOA9 */
#define PIO_PE4B_TIOB10              ( 1u << 4 )  /**< \brief Tc3 signal: TIOB10 */
#define PIO_PD22C_TIOB11             ( 1u << 22 ) /**< \brief Tc3 signal: TIOB11 */
#define PIO_PE1B_TIOB9               ( 1u << 1 )  /**< \brief Tc3 signal: TIOB9 */
/* ========== Pio definition for TWI0 peripheral ========== */
#define PIO_PA4A_TWCK0               ( 1u << 4 )  /**< \brief Twi0 signal: TWCK0 */
#define PIO_PA3A_TWD0                ( 1u << 3 )  /**< \brief Twi0 signal: TWD0 */
/* ========== Pio definition for TWI1 peripheral ========== */
#define PIO_PB5A_TWCK1               ( 1u << 5 )  /**< \brief Twi1 signal: TWCK1 */
#define PIO_PB4A_TWD1                ( 1u << 4 )  /**< \brief Twi1 signal: TWD1 */
/* ========== Pio definition for TWI2 peripheral ========== */
#define PIO_PD28C_TWCK2              ( 1u << 28 ) /**< \brief Twi2 signal: TWCK2 */
#define PIO_PD27C_TWD2               ( 1u << 27 ) /**< \brief Twi2 signal: TWD2 */
/* ========== Pio definition for UART0 peripheral ========== */
#define PIO_PA9A_URXD0               ( 1u << 9 )  /**< \brief Uart0 signal: URXD0 */
#define PIO_PA10A_UTXD0              ( 1u << 10 ) /**< \brief Uart0 signal: UTXD0 */
/* ========== Pio definition for UART1 peripheral ========== */
#define PIO_PA5C_URXD1               ( 1u << 5 )  /**< \brief Uart1 signal: URXD1 */
#define PIO_PA4C_UTXD1               ( 1u << 4 )  /**< \brief Uart1 signal: UTXD1 */
#define PIO_PA6C_UTXD1               ( 1u << 6 )  /**< \brief Uart1 signal: UTXD1 */
#define PIO_PD26D_UTXD1              ( 1u << 26 ) /**< \brief Uart1 signal: UTXD1 */
/* ========== Pio definition for UART2 peripheral ========== */
#define PIO_PD25C_URXD2              ( 1u << 25 ) /**< \brief Uart2 signal: URXD2 */
#define PIO_PD26C_UTXD2              ( 1u << 26 ) /**< \brief Uart2 signal: UTXD2 */
/* ========== Pio definition for UART3 peripheral ========== */
#define PIO_PD28A_URXD3              ( 1u << 28 ) /**< \brief Uart3 signal: URXD3 */
#define PIO_PD30A_UTXD3              ( 1u << 30 ) /**< \brief Uart3 signal: UTXD3 */
#define PIO_PD31B_UTXD3              ( 1u << 31 ) /**< \brief Uart3 signal: UTXD3 */
/* ========== Pio definition for UART4 peripheral ========== */
#define PIO_PD18C_URXD4              ( 1u << 18 ) /**< \brief Uart4 signal: URXD4 */
#define PIO_PD3C_UTXD4               ( 1u << 3 )  /**< \brief Uart4 signal: UTXD4 */
#define PIO_PD19C_UTXD4              ( 1u << 19 ) /**< \brief Uart4 signal: UTXD4 */
/* ========== Pio definition for USART0 peripheral ========== */
#define PIO_PB2C_CTS0                ( 1u << 2 )  /**< \brief Usart0 signal: CTS0 */
#define PIO_PD0D_DCD0                ( 1u << 0 )  /**< \brief Usart0 signal: DCD0 */
#define PIO_PD2D_DSR0                ( 1u << 2 )  /**< \brief Usart0 signal: DSR0 */
#define PIO_PD1D_DTR0                ( 1u << 1 )  /**< \brief Usart0 signal: DTR0 */
#define PIO_PD3D_RI0                 ( 1u << 3 )  /**< \brief Usart0 signal: RI0 */
#define PIO_PB3C_RTS0                ( 1u << 3 )  /**< \brief Usart0 signal: RTS0 */
#define PIO_PB0C_RXD0                ( 1u << 0 )  /**< \brief Usart0 signal: RXD0 */
#define PIO_PB13C_SCK0               ( 1u << 13 ) /**< \brief Usart0 signal: SCK0 */
#define PIO_PB1C_TXD0                ( 1u << 1 )  /**< \brief Usart0 signal: TXD0 */
/* ========== Pio definition for USART1 peripheral ========== */
#define PIO_PA25A_CTS1               ( 1u << 25 ) /**< \brief Usart1 signal: CTS1 */
#define PIO_PA26A_DCD1               ( 1u << 26 ) /**< \brief Usart1 signal: DCD1 */
#define PIO_PA28A_DSR1               ( 1u << 28 ) /**< \brief Usart1 signal: DSR1 */
#define PIO_PA27A_DTR1               ( 1u << 27 ) /**< \brief Usart1 signal: DTR1 */
#define PIO_PA3B_LONCOL1             ( 1u << 3 )  /**< \brief Usart1 signal: LONCOL1 */
#define PIO_PA29A_RI1                ( 1u << 29 ) /**< \brief Usart1 signal: RI1 */
#define PIO_PA24A_RTS1               ( 1u << 24 ) /**< \brief Usart1 signal: RTS1 */
#define PIO_PA21A_RXD1               ( 1u << 21 ) /**< \brief Usart1 signal: RXD1 */
#define PIO_PA23A_SCK1               ( 1u << 23 ) /**< \brief Usart1 signal: SCK1 */
#define PIO_PB4D_TXD1                ( 1u << 4 )  /**< \brief Usart1 signal: TXD1 */
/* ========== Pio definition for USART2 peripheral ========== */
#define PIO_PD19B_CTS2               ( 1u << 19 ) /**< \brief Usart2 signal: CTS2 */
#define PIO_PD4D_DCD2                ( 1u << 4 )  /**< \brief Usart2 signal: DCD2 */
#define PIO_PD6D_DSR2                ( 1u << 6 )  /**< \brief Usart2 signal: DSR2 */
#define PIO_PD5D_DTR2                ( 1u << 5 )  /**< \brief Usart2 signal: DTR2 */
#define PIO_PD7D_RI2                 ( 1u << 7 )  /**< \brief Usart2 signal: RI2 */
#define PIO_PD18B_RTS2               ( 1u << 18 ) /**< \brief Usart2 signal: RTS2 */
#define PIO_PD15B_RXD2               ( 1u << 15 ) /**< \brief Usart2 signal: RXD2 */
#define PIO_PD17B_SCK2               ( 1u << 17 ) /**< \brief Usart2 signal: SCK2 */
#define PIO_PD16B_TXD2               ( 1u << 16 ) /**< \brief Usart2 signal: TXD2 */
/* ========== Pio indexes ========== */
#define PIO_PA20_IDX                 0
#define PIO_PA19_IDX                 1
#define PIO_PA18_IDX                 2
#define PIO_PA17_IDX                 3
#define PIO_PA21_IDX                 4
#define PIO_PA7_IDX                  5
#define PIO_PA8_IDX                  6
#define PIO_PA22_IDX                 7
#define PIO_PA13_IDX                 8
#define PIO_PA16_IDX                 9
#define PIO_PA23_IDX                 10
#define PIO_PA15_IDX                 11
#define PIO_PA14_IDX                 12
#define PIO_PA24_IDX                 13
#define PIO_PA25_IDX                 14
#define PIO_PA26_IDX                 15
#define PIO_PA11_IDX                 16
#define PIO_PA10_IDX                 17
#define PIO_PA12_IDX                 18
#define PIO_PA27_IDX                 19
#define PIO_PA5_IDX                  20
#define PIO_PA9_IDX                  21
#define PIO_PA4_IDX                  22
#define PIO_PA3_IDX                  23
#define PIO_PA2_IDX                  24
#define PIO_PA1_IDX                  25
#define PIO_PA0_IDX                  26
#define PIO_PA28_IDX                 27
#define PIO_PA30_IDX                 29
#define PIO_PA31_IDX                 30
#define PIO_PB1_IDX                  32
#define PIO_PB0_IDX                  33
#define PIO_PB2_IDX                  34
#define PIO_PB3_IDX                  35
#define PIO_PB6_IDX                  36
#define PIO_PB12_IDX                 37
#define PIO_PB7_IDX                  38
#define PIO_PB4_IDX                  39
#define PIO_PB5_IDX                  40
#define PIO_PB8_IDX                  41
#define PIO_PB9_IDX                  42
#define PIO_PB13_IDX                 43
#define PIO_PB10_IDX                 44
#define PIO_PB11_IDX                 45
#define PIO_PD0_IDX                  96
#define PIO_PD31_IDX                 97
#define PIO_PD30_IDX                 98
#define PIO_PD27_IDX                 99
#define PIO_PD25_IDX                 100
#define PIO_PD26_IDX                 101
#define PIO_PD24_IDX                 102
#define PIO_PD22_IDX                 104
#define PIO_PD21_IDX                 105
#define PIO_PD20_IDX                 106
#define PIO_PD19_IDX                 107
#define PIO_PD18_IDX                 108
#define PIO_PD28_IDX                 109
#define PIO_PD17_IDX                 110
#define PIO_PD16_IDX                 111
#define PIO_PD14_IDX                 112
#define PIO_PD13_IDX                 113
#define PIO_PD12_IDX                 114
#define PIO_PD11_IDX                 115
#define PIO_PD10_IDX                 116
#define PIO_PD15_IDX                 117
#define PIO_PD9_IDX                  119
#define PIO_PD8_IDX                  120
#define PIO_PD7_IDX                  121
#define PIO_PD6_IDX                  122
#define PIO_PD5_IDX                  123
#define PIO_PD4_IDX                  124
#define PIO_PD3_IDX                  125
#define PIO_PD2_IDX                  126
#define PIO_PD1_IDX                  127

#endif /* _SAMV71N19_PIO_ */
